terraform/welcome/tests/load_test.yaml
config:
  target: "https://cv2kszmn2g.execute-api.us-east-1.amazonaws.com/v1"
  phases:
    - duration: 1 # test duration (seconds)
      arrivalRate: 3 # requests per second
  defaults:
    headers:
      x-api-key: "XXXXXXXX"
scenarios:
  - flow:
      - get:
          url: "/welcome"
      - log: "Sent GET request to private endpoint (API KEY) `welcome`"