terraform/welcome/tests/load_test.yaml
config:
  target: "{{ $processEnvironment.TARGET }}"
  ensure:
    p95: 200 # 95% of requests are under 200 milliseconds
    max: 500 # 99% of requests are under 500 milliseconds
  phases:
    - duration: 120 # test duration (seconds)
      arrivalRate: 10 # requests per second (as "users per second")
  defaults:
    headers:
      x-api-key: "{{ $processEnvironment.FREE_API_KEY }}"
scenarios:
  - flow:
      - get:
          url: "/welcome"
      - log: "Sent GET request to private endpoint (API KEY) `welcome`"