terraform/welcome/tests/load_test.yaml
config:
  target: "{{ $processEnvironment.TARGET }}"
  ensure:
    p95: 250
  phases:
    - duration: 1 # test duration (seconds)
      arrivalRate: 3 # requests per second
  defaults:
    headers:
      x-api-key: "XXXXXXXX" # TODO: inject API Key here for testing purposes
scenarios:
  - flow:
      - get:
          url: "/welcome"
      - log: "Sent GET request to private endpoint (API KEY) `welcome`"